apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_xrdc.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k3xx_xrdc.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_XRDC_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_XRDC_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <hardware/s32k3xx_memorymap.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* XRDC Register Offsets ****************************************************/

#define S32K3XX_XRDC_CR_OFFSET             (0x0000) /* Control Register (CR) */
#define S32K3XX_XRDC_HWCFG0_OFFSET         (0x00f0) /* Hardware Configuration Register 0 (HWCFG0) */
#define S32K3XX_XRDC_HWCFG1_OFFSET         (0x00f4) /* Hardware Configuration Register 1 (HWCFG1) */
#define S32K3XX_XRDC_HWCFG2_OFFSET         (0x00f8) /* Hardware Configuration Register 2 (HWCFG2) */
#define S32K3XX_XRDC_MDACFG0_OFFSET        (0x0100) /* Master Domain Assignment Configuration Register 0 (MDACFG0) */
#define S32K3XX_XRDC_MDACFG1_OFFSET        (0x0101) /* Master Domain Assignment Configuration Register 1 (MDACFG1) */
#define S32K3XX_XRDC_MDACFG2_OFFSET        (0x0102) /* Master Domain Assignment Configuration Register 2 (MDACFG2) */
#define S32K3XX_XRDC_MDACFG3_OFFSET        (0x0103) /* Master Domain Assignment Configuration Register 3 (MDACFG3) */
#define S32K3XX_XRDC_MDACFG4_OFFSET        (0x0104) /* Master Domain Assignment Configuration Register 4 (MDACFG4) */
#define S32K3XX_XRDC_MDACFG5_OFFSET        (0x0105) /* Master Domain Assignment Configuration Register 5 (MDACFG5) */
#define S32K3XX_XRDC_MRCFG0_OFFSET         (0x0140) /* Memory Region Configuration Register 0 (MRCFG0) */
#define S32K3XX_XRDC_MRCFG1_OFFSET         (0x0141) /* Memory Region Configuration Register 1 (MRCFG1) */
#define S32K3XX_XRDC_MRCFG2_OFFSET         (0x0142) /* Memory Region Configuration Register 2 (MRCFG2) */
#define S32K3XX_XRDC_DERRLOC0_OFFSET       (0x0200) /* Domain Error Location Register 0 (DERRLOC0) */
#define S32K3XX_XRDC_DERRLOC1_OFFSET       (0x0204) /* Domain Error Location Register 1 (DERRLOC1) */
#define S32K3XX_XRDC_DERRLOC2_OFFSET       (0x0208) /* Domain Error Location Register 2 (DERRLOC2) */
#define S32K3XX_XRDC_DERR_W0_0_OFFSET      (0x0400) /* Domain Error Word 0 (DERR_W0_0) */
#define S32K3XX_XRDC_DERR_W1_0_OFFSET      (0x0404) /* Domain Error Word 1 (DERR_W1_0) */
#define S32K3XX_XRDC_DERR_W3_0_OFFSET      (0x040c) /* Domain Error Word 3 (DERR_W3_0) */
#define S32K3XX_XRDC_DERR_W0_1_OFFSET      (0x0410) /* Domain Error Word 0 (DERR_W0_1) */
#define S32K3XX_XRDC_DERR_W1_1_OFFSET      (0x0414) /* Domain Error Word 1 (DERR_W1_1) */
#define S32K3XX_XRDC_DERR_W3_1_OFFSET      (0x041c) /* Domain Error Word 3 (DERR_W3_1) */
#define S32K3XX_XRDC_DERR_W0_2_OFFSET      (0x0420) /* Domain Error Word 0 (DERR_W0_2) */
#define S32K3XX_XRDC_DERR_W1_2_OFFSET      (0x0424) /* Domain Error Word 1 (DERR_W1_2) */
#define S32K3XX_XRDC_DERR_W3_2_OFFSET      (0x042c) /* Domain Error Word 3 (DERR_W3_2) */
#define S32K3XX_XRDC_DERR_W0_16_OFFSET     (0x0500) /* Domain Error Word 0 (DERR_W0_16) */
#define S32K3XX_XRDC_DERR_W1_16_OFFSET     (0x0504) /* Domain Error Word 1 (DERR_W1_16) */
#define S32K3XX_XRDC_DERR_W3_16_OFFSET     (0x050c) /* Domain Error Word 3 (DERR_W3_16) */
#define S32K3XX_XRDC_DERR_W0_17_OFFSET     (0x0510) /* Domain Error Word 0 (DERR_W0_17) */
#define S32K3XX_XRDC_DERR_W1_17_OFFSET     (0x0514) /* Domain Error Word 1 (DERR_W1_17) */
#define S32K3XX_XRDC_DERR_W3_17_OFFSET     (0x051c) /* Domain Error Word 3 (DERR_W3_17) */
#define S32K3XX_XRDC_DERR_W0_18_OFFSET     (0x0520) /* Domain Error Word 0 (DERR_W0_18) */
#define S32K3XX_XRDC_DERR_W1_18_OFFSET     (0x0524) /* Domain Error Word 1 (DERR_W1_18) */
#define S32K3XX_XRDC_DERR_W3_18_OFFSET     (0x052c) /* Domain Error Word 3 (DERR_W3_18) */
#define S32K3XX_XRDC_PID0_OFFSET           (0x0700) /* Process Identifier (PID0) */
#define S32K3XX_XRDC_PID3_OFFSET           (0x070c) /* Process Identifier (PID3) */
#define S32K3XX_XRDC_PID4_OFFSET           (0x0710) /* Process Identifier (PID4) */
#define S32K3XX_XRDC_MDA_W0_0_DFMT0_OFFSET (0x0800) /* Master Domain Assignment (MDA_W0_0_DFMT0) */
#define S32K3XX_XRDC_MDA_W0_1_DFMT1_OFFSET (0x0820) /* Master Domain Assignment (MDA_W0_1_DFMT1) */
#define S32K3XX_XRDC_MDA_W0_2_DFMT1_OFFSET (0x0840) /* Master Domain Assignment (MDA_W0_2_DFMT1) */
#define S32K3XX_XRDC_MDA_W0_3_DFMT0_OFFSET (0x0860) /* Master Domain Assignment (MDA_W0_3_DFMT0) */
#define S32K3XX_XRDC_MDA_W0_4_DFMT0_OFFSET (0x0870) /* Master Domain Assignment (MDA_W0_4_DFMT0) */
#define S32K3XX_XRDC_MDA_W0_5_DFMT1_OFFSET (0x08a0) /* Master Domain Assignment (MDA_W0_5_DFMT1) */

#define S32K3XX_XRDC_PDAC_W0_OFFSET(n)     (0x1100 + (((n) - 32) << 3)) /* Peripheral Domain Access Control (PDAC_W0_n, n=32..315) */
#define S32K3XX_XRDC_PDAC_W1_OFFSET(n)     (0x1104 + (((n) - 32) << 3)) /* Peripheral Domain Access Control (PDAC_W1_n, n=32..315) */

