apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_xrdc.h
#define S32K3XX_XRDC_MRGD_W0_OFFSET(n)     (0x2000 + ((n) << 5)) /* Memory Region Descriptor (MRGD_W0_n, n=0..35) */
#define S32K3XX_XRDC_MRGD_W1_OFFSET(n)     (0x2004 + ((n) << 5)) /* Memory Region Descriptor (MRGD_W1_n, n=0..35) */
#define S32K3XX_XRDC_MRGD_W2_OFFSET(n)     (0x2008 + ((n) << 5)) /* Memory Region Descriptor (MRGD_W2_n, n=0..35) */
#define S32K3XX_XRDC_MRGD_W3_OFFSET(n)     (0x200c + ((n) << 5)) /* Memory Region Descriptor (MRGD_W3_n, n=0..35) */

/* XRDC Register Addresses **************************************************/

#define S32K3XX_XRDC_CR                    (S32K3XX_XRDC_BASE + S32K3XX_XRDC_CR_OFFSET)
#define S32K3XX_XRDC_HWCFG0                (S32K3XX_XRDC_BASE + S32K3XX_XRDC_HWCFG0_OFFSET)
#define S32K3XX_XRDC_HWCFG1                (S32K3XX_XRDC_BASE + S32K3XX_XRDC_HWCFG1_OFFSET)
#define S32K3XX_XRDC_HWCFG2                (S32K3XX_XRDC_BASE + S32K3XX_XRDC_HWCFG2_OFFSET)
#define S32K3XX_XRDC_MDACFG0               (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MDACFG0_OFFSET)
#define S32K3XX_XRDC_MDACFG1               (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MDACFG0_OFFSET)
#define S32K3XX_XRDC_MDACFG2               (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MDACFG0_OFFSET)
#define S32K3XX_XRDC_MDACFG3               (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MDACFG0_OFFSET)
#define S32K3XX_XRDC_MDACFG4               (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MDACFG0_OFFSET)
#define S32K3XX_XRDC_MDACFG5               (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MDACFG0_OFFSET)
#define S32K3XX_XRDC_MRCFG0                (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MRCFG0_OFFSET)
#define S32K3XX_XRDC_MRCFG1                (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MRCFG1_OFFSET)
#define S32K3XX_XRDC_MRCFG2                (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MRCFG2_OFFSET)
#define S32K3XX_XRDC_DERRLOC0              (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERRLOC0_OFFSET)
#define S32K3XX_XRDC_DERRLOC1              (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERRLOC1_OFFSET)
#define S32K3XX_XRDC_DERRLOC2              (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERRLOC2_OFFSET)
#define S32K3XX_XRDC_DERR_W0_0             (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W0_0_OFFSET)
#define S32K3XX_XRDC_DERR_W1_0             (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W1_0_OFFSET)
#define S32K3XX_XRDC_DERR_W3_0             (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W3_0_OFFSET)
#define S32K3XX_XRDC_DERR_W0_1             (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W0_1_OFFSET)
#define S32K3XX_XRDC_DERR_W1_1             (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W1_1_OFFSET)
#define S32K3XX_XRDC_DERR_W3_1             (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W3_1_OFFSET)
#define S32K3XX_XRDC_DERR_W0_2             (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W0_2_OFFSET)
#define S32K3XX_XRDC_DERR_W1_2             (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W1_2_OFFSET)
#define S32K3XX_XRDC_DERR_W3_2             (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W3_2_OFFSET)
#define S32K3XX_XRDC_DERR_W0_16            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W0_16_OFFSET)
#define S32K3XX_XRDC_DERR_W1_16            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W1_16_OFFSET)
#define S32K3XX_XRDC_DERR_W3_16            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W3_16_OFFSET)
#define S32K3XX_XRDC_DERR_W0_17            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W0_17_OFFSET)
#define S32K3XX_XRDC_DERR_W1_17            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W1_17_OFFSET)
#define S32K3XX_XRDC_DERR_W3_17            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W3_17_OFFSET)
#define S32K3XX_XRDC_DERR_W0_18            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W0_18_OFFSET)
#define S32K3XX_XRDC_DERR_W1_18            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W1_18_OFFSET)
#define S32K3XX_XRDC_DERR_W3_18            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_DERR_W3_18_OFFSET)
#define S32K3XX_XRDC_PID0                  (S32K3XX_XRDC_BASE + S32K3XX_XRDC_PID0_OFFSET)
#define S32K3XX_XRDC_PID3                  (S32K3XX_XRDC_BASE + S32K3XX_XRDC_PID3_OFFSET)
#define S32K3XX_XRDC_PID4                  (S32K3XX_XRDC_BASE + S32K3XX_XRDC_PID4_OFFSET)
#define S32K3XX_XRDC_MDA_W0_0_DFMT0        (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MDA_W0_0_DFMT0_OFFSET)
#define S32K3XX_XRDC_MDA_W0_1_DFMT1        (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MDA_W0_1_DFMT1_OFFSET)
#define S32K3XX_XRDC_MDA_W0_2_DFMT1        (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MDA_W0_2_DFMT1_OFFSET)
#define S32K3XX_XRDC_MDA_W0_3_DFMT0        (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MDA_W0_3_DFMT0_OFFSET)
#define S32K3XX_XRDC_MDA_W0_4_DFMT0        (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MDA_W0_4_DFMT0_OFFSET)
#define S32K3XX_XRDC_MDA_W0_5_DFMT1        (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MDA_W0_5_DFMT1_OFFSET)

#define S32K3XX_XRDC_PDAC_W0(n)            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_PDAC_W0_OFFSET(n))
#define S32K3XX_XRDC_PDAC_W1(n)            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_PDAC_W1_OFFSET(n))
#define S32K3XX_XRDC_MRGD_W0(n)            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MRGD_W0_OFFSET(n))
#define S32K3XX_XRDC_MRGD_W1(n)            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MRGD_W1_OFFSET(n))
#define S32K3XX_XRDC_MRGD_W2(n)            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MRGD_W2_OFFSET(n))
#define S32K3XX_XRDC_MRGD_W3(n)            (S32K3XX_XRDC_BASE + S32K3XX_XRDC_MRGD_W3_OFFSET(n))

/* XRDC Register Bitfield Definitions ***************************************/

/* Control Register (CR) */

#define XRDC_CR_GVLD                      (1 << 0)  /* Bit 0: Global Valid (XRDC Global Enable/Disable) (GLVD) */
#define XRDC_CR_HRL_SHIFT                 (1)       /* Bits 1-4: Hardware Revision Level (HRL) */
#define XRDC_CR_HRL_MASK                  (0x0f << XRDC_CR_HRL_SHIFT)
                                                    /* Bits 5-6: Reserved */
#define XRDC_CR_MRF                       (1 << 7)  /* Bit 7: Memory Region Format (MRF) */
#define XRDC_CR_VAW                       (1 << 8)  /* Bit 8: Virtualization Aware (VAW) */
                                                    /* Bit 9-29: Reserved */
#define XRDC_CR_LK1                       (1 << 30) /* Bit 30: Lock (LK1) */
                                                    /* Bit 31: Reserved */

/* Hardware Configuration Register 0 (HWCFG0) */

#define XRDC_HWCFG0_NDID_SHIFT            (0)       /* Bits 0-7: Number Of Domains (NDID) */
#define XRDC_HWCFG0_NDID_MASK             (0xff << XRDC_HWCFG0_NDID_SHIFT)
#define XRDC_HWCFG0_NMSTR_SHIFT           (8)       /* Bits 8-15: Number Of Bus Masters (NMSTR) */
#define XRDC_HWCFG0_NMSTR_MASK            (0xff << XRDC_HWCFG0_NMSTR_SHIFT)
#define XRDC_HWCFG0_NMRC_SHIFT            (16)     /* Bits 16-23: Number Of MRCs (NMRC) */
#define XRDC_HWCFG0_NMRC_MASK             (0xff << XRDC_HWCFG0_NMRC_SHIFT)
#define XRDC_HWCFG0_NPAC_SHIFT            (24)     /* Bits 24-27: Number of PACs (NPAC) */
#define XRDC_HWCFG0_NPAC_MASK             (0x0f << XRDC_HWCFG0_NPAC_SHIFT)
#define XRDC_HWCFG0_MID_SHIFT             (28)     /* Bits 28-31: Module ID (MID) */
#define XRDC_HWCFG0_MID_MASK              (0x0f << XRDC_HWCFG0_MID_SHIFT)

/* Hardware Configuration Register 1 (HWCFG1) */

#define XRDC_HWCFG1_DID_SHIFT             (0)      /* Bits 0-3: Domain Identifier Number (DID) */
#define XRDC_HWCFG1_DID_MASK              (0x0f << XRDC_HWCFG1_DID_SHIFT)
                                                   /* Bits 4-31: Reserved */

/* Hardware Configuration Register 2 (HWCFG2) */

